Revit.Elements.SunSettings.TranslateTime(System.DateTime)
Fix: https://github.com/DynamoDS/DynamoRevit/pull/879
StartDateAndTime, EndDateAndTime and ActiveFrameTime should return local datetime,
that is set in Revit project configuration.
But it returns customized datetime + user timezone offset, which is incorrect.
Althought in documentation it's said,
that "The output value will be in Coordinated Universal Time (UTC),
but input may be in local time as well."
There is no means to return local time.